---
kind: property
id: P:Autodesk.Revit.DB.Visual.Water.WaterColorByObject
source: html/8152216e-a83d-dd77-2df5-55a78c4b9369.htm
---
# Autodesk.Revit.DB.Visual.Water.WaterColorByObject Property

The property labeled "Custom Color" from the "Water" schema.

## Syntax (C#)
```csharp
public static string WaterColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".